code-review/NRB_3471_3546/База_Стало/DataProcessors/ОбработкаОперацийПоОбслуживаниюЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОбработкаОперацийПоОбслуживаниюЦБ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСНачалаВремен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦБ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоНачальныйОстаток</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОстаток</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПриход</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоРасход</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Снятие</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЗагрузки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/DataProcessors/ОбработкаОперацийПоОбслуживаниюЦБ/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВыборПериода(Команда)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		НастройкаПериода = Новый НастройкаПериода;
		НастройкаПериода.УстановитьПериод(Объект.ПериодНачало, ?(Объект.ПериодНачало='0001-01-01', Объект.ПериодКонец, НачалоДня(Объект.ПериодНачало)));
		НастройкаПериода.РедактироватьКакИнтервал	= Истина;
		НастройкаПериода.РедактироватьКакПериод		= Истина;
		НастройкаПериода.ВариантНастройки			= ВариантНастройкиПериода.Период;
		НастройкаПериода.ВариантПериода				= ВариантПериода.Год;
		Если НастройкаПериода.Редактировать() Тогда
			Объект.ПериодНачало	= НастройкаПериода.ПолучитьДатуНачала();
			Объект.ПериодКонец	= НастройкаПериода.ПолучитьДатуОкончания();
		КонецЕсли;
	#Иначе
		Диалог	= Новый ДиалогРедактированияСтандартногоПериода();		
		Диалог.Период.ДатаНачала	= Объект.ПериодНачало;
		Диалог.Период.ДатаОкончания	= ?(Объект.ПериодНачало=Дата('0001-01-01'), Объект.ПериодКонец, НачалоДня(Объект.ПериодНачало));
		Диалог.Период.Вариант		= ВариантСтандартногоПериода.ПроизвольныйПериод;
		
		Если Диалог.Редактировать() Тогда
			Объект.ПериодНачало	= НачалоДня(Диалог.Период.ДатаНачала);
			Объект.ПериодКонец	= КонецДня(Диалог.Период.ДатаОкончания);
		КонецЕсли;		
	#КонецЕсли
	


КонецПроцедуры

&НаКлиенте
Процедура ОтобратьЦенныеБумаги(Команда)
	Если Объект.ПериодКонец >= Объект.ПериодНачало 
		И ЗначениеЗаполнено(Объект.ПериодНачало)
	Тогда
		ОтобратьЦенныеБумагиНаСервере();
	Иначе
		Предупреждение("Неверно указан диапазон дат для обработки!");
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОтобратьЦенныеБумагиНаСервере()
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.ОтобратьЦенныеБумаги(Операция = 0, Операция = 1);
	ЗначениеВРеквизитФормы(Обработка, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	Для Каждого Строка Из Объект.ЦенныеБумаги Цикл
		Строка.Пометка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	Для Каждого Строка Из Объект.ЦенныеБумаги Цикл
		Строка.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоручения(Команда)
	Если Объект.ЦенныеБумаги.Количество() Тогда
		СоздатьПорученияНаСервере();
	Иначе
		Предупреждение("Нет данных для обработки! Попробуйте отобрать цнные бумаги ещё раз."); 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СоздатьПорученияНаСервере()
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.СоздатьПоручения(Операция = 0, Операция = 1);
КонецПроцедуры

&НаКлиенте
Процедура ОперацияПриИзменении(Элемент)
	
	Объект.ЦенныеБумаги.Очистить();
	Элементы.ЦенныеБумагиКоличествоПриход.Видимость = Не Операция;
	Элементы.ЦенныеБумагиКоличествоРасход.Видимость = Не Операция;
	Элементы.ЦенныеБумагиКодЗагрузки.Видимость = Операция;
	Если Объект.ПериодКонец >= Объект.ПериодНачало 
		И ЗначениеЗаполнено(Объект.ПериодНачало)
	Тогда
		ОтобратьЦенныеБумагиНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКонтроль(Команда)
	
	Если Объект.ПериодКонец >= Объект.ПериодНачало 
		И ЗначениеЗаполнено(Объект.ПериодНачало) Тогда
		ОткрытьФорму("Обработка.ОбработкаОперацийПоОбслуживаниюЦБ.Форма.ФормаКонтроля", Новый Структура("Данные", Объект));
		
	Иначе
		Предупреждение("Неверно указан диапазон дат для обработки!");
	КонецЕсли;
	
КонецПроцедуры
